In [1]:
import pandas as pd
import numpy as np

sp500 = pd.read_csv('data/sp500.csv', index_col = 'Symbol', usecols = [0, 2, 3, 7])

In [3]:
ndf = sp500.rename(columns = {'Book Value' : 'BookValue'})
ndf[:2]

             Sector   Price  BookValue
Symbol
MMM     Industrials  141.14     26.668
ABT     Health Care   39.60     15.573

In [4]:
sp500.columns

Index(['Sector', 'Price', 'Book Value'], dtype='object')

In [8]:
sp500.rename(columns = {'Book Value' : 'BookValue'}, inplace= True)
sp500.columns

Index(['Sector', 'Price', 'BookValue'], dtype='object')

In [10]:
sp500.BookValue[:5]

Symbol
MMM     26.668
ABT     15.573
ABBV     2.954
ACN      8.326
ACE     86.897
Name: BookValue, dtype: float64

In [11]:
copy = sp500.copy()
copy['RoundedPrice'] = sp500.Price.round()
copy[:2]

             Sector   Price  BookValue  RoundedPrice
Symbol
MMM     Industrials  141.14     26.668         141.0
ABT     Health Care   39.60     15.573          40.0

## insert

In [12]:
copy2 = sp500.copy()
copy2.insert(1, 'RoundedPrice', sp500.Price.round())
copy2[:2]

             Sector  RoundedPrice   Price  BookValue
Symbol
MMM     Industrials         141.0  141.14     26.668
ABT     Health Care          40.0   39.60     15.573

## loc

In [13]:
ss = sp500[:3].copy()
ss.loc[:, 'PER'] = 0
ss

             Sector   Price  BookValue  PER
Symbol
MMM     Industrials  141.14     26.668    0
ABT     Health Care   39.60     15.573    0
ABBV    Health Care   53.95      2.954    0

In [14]:
sp500[:3]

             Sector   Price  BookValue
Symbol
MMM     Industrials  141.14     26.668
ABT     Health Care   39.60     15.573
ABBV    Health Care   53.95      2.954

In [15]:
ss = sp500[:3].copy()
np.random.seed(123456)
ss.loc[:, 'PER'] = pd.Series(np.random.normal(size = 3), index = ss.index)
ss

             Sector   Price  BookValue       PER
Symbol
MMM     Industrials  141.14     26.668  0.469112
ABT     Health Care   39.60     15.573 -0.282863
ABBV    Health Care   53.95      2.954 -1.509059

## pd.concat

In [19]:
rounded_price = pd.DataFrame({'RoundedPrice' : sp500.Price.round()})
concatenated = pd.concat([sp500, rounded_price], axis = 1)
concatenated.head()

                        Sector   Price  BookValue  RoundedPrice
Symbol
MMM                Industrials  141.14     26.668         141.0
ABT                Health Care   39.60     15.573          40.0
ABBV               Health Care   53.95      2.954          54.0
ACN     Information Technology   79.79      8.326          80.0
ACE                 Financials  102.91     86.897         103.0

In [20]:
rounded_price = pd.DataFrame({'Price' : sp500.Price.round()})
rounded_price.head()

        Price
Symbol
MMM     141.0
ABT      40.0
ABBV     54.0
ACN      80.0
ACE     103.0

In [21]:
dups = pd.concat([sp500, rounded_price], axis=1)
dups.head()

                        Sector   Price  BookValue  Price
Symbol
MMM                Industrials  141.14     26.668  141.0
ABT                Health Care   39.60     15.573   40.0
ABBV               Health Care   53.95      2.954   54.0
ACN     Information Technology   79.79      8.326   80.0
ACE                 Financials  102.91     86.897  103.0

In [22]:
dups.Price.head()

         Price  Price
Symbol
MMM     141.14  141.0
ABT      39.60   40.0
ABBV     53.95   54.0
ACN      79.79   80.0
ACE     102.91  103.0

In [24]:
reversed_colname = sp500.columns[::-1]
sp500[reversed_colname]

        BookValue   Price                  Sector
Symbol
MMM        26.668  141.14             Industrials
ABT        15.573   39.60             Health Care
ABBV        2.954   53.95             Health Care
ACN         8.326   79.79  Information Technology
ACE        86.897  102.91              Financials
...           ...     ...                     ...
YHOO       12.768   35.02  Information Technology
YUM         5.147   74.77  Consumer Discretionary
ZMH        37.181  101.84             Health Care
ZION       30.191   28.43              Financials
ZTS         2.150   30.53             Health Care

[500 rows x 3 columns]

In [27]:
sp500[sp500.columns[::-1]]

        BookValue   Price                  Sector
Symbol
MMM        26.668  141.14             Industrials
ABT        15.573   39.60             Health Care
ABBV        2.954   53.95             Health Care
ACN         8.326   79.79  Information Technology
ACE        86.897  102.91              Financials
...           ...     ...                     ...
YHOO       12.768   35.02  Information Technology
YUM         5.147   74.77  Consumer Discretionary
ZMH        37.181  101.84             Health Care
ZION       30.191   28.43              Financials
ZTS         2.150   30.53             Health Care

[500 rows x 3 columns]

In [29]:
copy = sp500.copy()
copy.Price = rounded_price.Price
copy.head()

                        Sector  Price  BookValue
Symbol
MMM                Industrials  141.0     26.668
ABT                Health Care   40.0     15.573
ABBV               Health Care   54.0      2.954
ACN     Information Technology   80.0      8.326
ACE                 Financials  103.0     86.897

In [30]:
copy = sp500.copy()
copy.loc[:,'Price'] = rounded_price.Price
copy.head()

                        Sector  Price  BookValue
Symbol
MMM                Industrials  141.0     26.668
ABT                Health Care   40.0     15.573
ABBV               Health Care   54.0      2.954
ACN     Information Technology   80.0      8.326
ACE                 Financials  103.0     86.897

## colunm 삭제

In [33]:
copy = sp500.copy()
del copy['BookValue']
copy[:2]

             Sector   Price
Symbol
MMM     Industrials  141.14
ABT     Health Care   39.60

In [34]:
copy = sp500.copy()
poped = copy.pop('Sector')
copy[:2]

         Price  BookValue
Symbol
MMM     141.14     26.668
ABT      39.60     15.573

In [37]:
poped[:5]

Symbol
MMM                Industrials
ABT                Health Care
ABBV               Health Care
ACN     Information Technology
ACE                 Financials
Name: Sector, dtype: object

In [38]:
copy = sp500.copy()
afterdrop = copy.drop(['Sector'], axis = 1)
afterdrop[:5]

         Price  BookValue
Symbol
MMM     141.14     26.668
ABT      39.60     15.573
ABBV     53.95      2.954
ACN      79.79      8.326
ACE     102.91     86.897

In [39]:
df1 = sp500.iloc[0:3].copy()
df2 = sp500.iloc[[10, 11, 2]]
appended = df1.append(df2)
appended

             Sector   Price  BookValue
Symbol
MMM     Industrials  141.14     26.668
ABT     Health Care   39.60     15.573
ABBV    Health Care   53.95      2.954
A       Health Care   56.18     16.928
GAS       Utilities   52.98     32.462
ABBV    Health Care   53.95      2.954

In [40]:
df2

             Sector  Price  BookValue
Symbol
A       Health Care  56.18     16.928
GAS       Utilities  52.98     32.462
ABBV    Health Care  53.95      2.954

In [41]:
df3 = pd.DataFrame(
    0.0,
    index = df1.index,
    columns=['PER']
)
df3

        PER
Symbol
MMM     0.0
ABT     0.0
ABBV    0.0

In [42]:
df1.append(df3)

             Sector   Price  BookValue  PER
Symbol
MMM     Industrials  141.14     26.668  NaN
ABT     Health Care   39.60     15.573  NaN
ABBV    Health Care   53.95      2.954  NaN
MMM             NaN     NaN        NaN  0.0
ABT             NaN     NaN        NaN  0.0
ABBV            NaN     NaN        NaN  0.0

In [43]:
df1.append(df3, ignore_index=True)

        Sector   Price  BookValue  PER
0  Industrials  141.14     26.668  NaN
1  Health Care   39.60     15.573  NaN
2  Health Care   53.95      2.954  NaN
3          NaN     NaN        NaN  0.0
4          NaN     NaN        NaN  0.0
5          NaN     NaN        NaN  0.0

In [44]:
df1 = sp500.iloc[0:3].copy()
df2 = sp500.iloc[[10, 11, 2]]
pd.concat([df1, df2])

             Sector   Price  BookValue
Symbol
MMM     Industrials  141.14     26.668
ABT     Health Care   39.60     15.573
ABBV    Health Care   53.95      2.954
A       Health Care   56.18     16.928
GAS       Utilities   52.98     32.462
ABBV    Health Care   53.95      2.954

In [45]:
ndf = df2.copy()
ndf.insert(3, 'Foo', pd.Series(0, index = df2.index))
ndf

             Sector  Price  BookValue  Foo
Symbol
A       Health Care  56.18     16.928    0
GAS       Utilities  52.98     32.462    0
ABBV    Health Care  53.95      2.954    0

In [46]:
pd.concat([df1, ndf])

             Sector   Price  BookValue  Foo
Symbol
MMM     Industrials  141.14     26.668  NaN
ABT     Health Care   39.60     15.573  NaN
ABBV    Health Care   53.95      2.954  NaN
A       Health Care   56.18     16.928  0.0
GAS       Utilities   52.98     32.462  0.0
ABBV    Health Care   53.95      2.954  0.0

In [47]:
r = pd.concat([df1, ndf], keys = ['df1', 'df2'])
r

                 Sector   Price  BookValue  Foo
    Symbol
df1 MMM     Industrials  141.14     26.668  NaN
    ABT     Health Care   39.60     15.573  NaN
    ABBV    Health Care   53.95      2.954  NaN
df2 A       Health Care   56.18     16.928  0.0
    GAS       Utilities   52.98     32.462  0.0
    ABBV    Health Care   53.95      2.954  0.0

In [48]:
ss = sp500[:3].copy()
ss.loc['FOO'] = ['the sector', 100, 110]
ss

             Sector   Price  BookValue
Symbol
MMM     Industrials  141.14     26.668
ABT     Health Care   39.60     15.573
ABBV    Health Care   53.95      2.954
FOO      the sector  100.00    110.000

In [49]:
ss = sp500[:5]
ss

                        Sector   Price  BookValue
Symbol
MMM                Industrials  141.14     26.668
ABT                Health Care   39.60     15.573
ABBV               Health Care   53.95      2.954
ACN     Information Technology   79.79      8.326
ACE                 Financials  102.91     86.897

In [51]:
afterdrop = ss.drop(['ABT', 'ACN'])
afterdrop[:5]

             Sector   Price  BookValue
Symbol
MMM     Industrials  141.14     26.668
ABBV    Health Care   53.95      2.954
ACE      Financials  102.91     86.897

In [55]:
selection = sp500.Price > 300
(len(selection), selection.sum())

(500, 10)

In [56]:
price_less_than_300 = sp500[~selection]
price_less_than_300

                        Sector   Price  BookValue
Symbol
MMM                Industrials  141.14     26.668
ABT                Health Care   39.60     15.573
ABBV               Health Care   53.95      2.954
ACN     Information Technology   79.79      8.326
ACE                 Financials  102.91     86.897
...                        ...     ...        ...
YHOO    Information Technology   35.02     12.768
YUM     Consumer Discretionary   74.77      5.147
ZMH                Health Care  101.84     37.181
ZION                Financials   28.43     30.191
ZTS                Health Care   30.53      2.150

[490 rows x 3 columns]

In [57]:
only_frist_three = sp500[:3]
only_frist_three

             Sector   Price  BookValue
Symbol
MMM     Industrials  141.14     26.668
ABT     Health Care   39.60     15.573
ABBV    Health Care   53.95      2.954

In [58]:
only_frist_three = sp500[:3].copy()
only_frist_three

             Sector   Price  BookValue
Symbol
MMM     Industrials  141.14     26.668
ABT     Health Care   39.60     15.573
ABBV    Health Care   53.95      2.954